InformationRegisters/ФискальныеОперацииРК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ФискальныеОперацииРК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремяЧека</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСуммаЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтономныйРежимРаботыКассы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомерКассы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеФискальнойОперацииБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ПечатьФискальныхДокументовРККлиентПереопределяемый/Ext/Module.bsl
// Описание: Получает оборудование по организации
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияБПО - Организация.
// 
// Возвращаемое значение:
//  Структура - Структура по свойствами:
//   * Терминал - СправочникСсылка.ПодключаемоеОборудование - Терминал.
//   * ФискальныеУстройства - СправочникСсылка.ПодключаемоеОборудование - ФискальныеУстройства.
//
Процедура ОбработатьСостояниеСмены(Форма, ОписаниеОповещенияЗавершение) Экспорт
	
	//в БК не используется
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершение, Истина);
			
КонецПроцедуры

// Описание: Возвращает числовое значение ставки НДС по ссылка
//
// Параметры:
//  СтавкаНДС - СправочникСсылка.СтавкиНДС
// 
// Возвращаемое значение:
//  Числовове значение ставки НДС (0.12, 0 и тд)
//
Функция СтавкаНДСЧислом(СтавкаНДС) Экспорт
	
	ЗначениеСтавки = ?(ЗначениеЗаполнено(СтавкаНДС), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтавкаНДС, "Ставка"), 0);
	 
	Если НЕ ЗначениеСтавки = 0 Тогда
		Возврат ЗначениеСтавки / 100;
	КонецЕсли;
	
	Возврат 0;	
	
КонецФункции

// Описание: Обработка строки табличной части - вызывается из форм документов.
//
// Параметры:
//  СтрокаТаблицы		 - Структура - данные обрабатываемой строки.
//  СтруктураДействий	 - Структура - описывает действия, где Ключ - наименование действия, Значение - Структура - параметры действия.
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке.
//
Процедура ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Действие Из СтруктураДействий Цикл
		//Если Действие.Ключ = "ПересчитатьСумму"  Тогда
		//	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуТабЧасти(СтрокаТаблицы);
		//ИначеЕсли Действие.Ключ = "ПересчитатьЦенуПоСумме"  Тогда
		//	ОбработкаТабличныхЧастейКлиентСервер.ПриИзмененииСуммыТабЧасти(СтрокаТаблицы);
		//КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

// Описание: Обработка полученных результатов после обработки чека оборудованием
//
Процедура ОбработатьРезультатаЧека(Форма, ВыходныеПараметры, Оплаты) Экспорт
	
	ФискальнаяОперацияРеквизиты = ПодключаемоеОборудованиеБКВызовСервера.СтруктураФискальнойОперацииРК();
	
	//Если последним значением выходных параметров является структура то это информация ККМ по чеку
	Если ТипЗнч(ВыходныеПараметры[ВыходныеПараметры.Количество() - 1]) = Тип("Структура") Тогда 
		ДанныеЧека = ВыходныеПараметры[ВыходныеПараметры.Количество() - 1];
		
		ФискальнаяОперацияРеквизиты.НомерЧека 					= ?(ДанныеЧека.Свойство("ФискальныйНомер"), ДанныеЧека.ФискальныйНомер, "");
		ФискальнаяОперацияРеквизиты.АвтономныйРежимРаботыКассы 	= ?(ДанныеЧека.Свойство("АвтономныйРежимРаботы"), ДанныеЧека.АвтономныйРежимРаботы, Ложь);
		ФискальнаяОперацияРеквизиты.РегистрационныйНомерКассы 	= ?(ДанныеЧека.Свойство("РегистрационныйНомерККМ"), ДанныеЧека.РегистрационныйНомерККМ, "");
		ФискальнаяОперацияРеквизиты.ДатаВремяЧека				= ?(ДанныеЧека.Свойство("ДатаЧека"), ДанныеЧека.ДатаЧека, Дата("00010101"));
	КонецЕсли;   
	
	///////////////////////////////////////////////////////////
	// ОМГ 
	Если ТипЗнч(ВыходныеПараметры) = Тип("Массив")  Тогда
	Если ВыходныеПараметры.Количество() > 4  Тогда
		Если ТипЗнч(ВыходныеПараметры[4]) = Тип("Структура") Тогда
			Если ВыходныеПараметры[4].Свойство("СерийныйНомерККМ") Тогда            
			ФискальнаяОперацияРеквизиты.НомерЧека 					= ?(ВыходныеПараметры[4].Свойство("ФискальныйНомер"), ВыходныеПараметры[4].ФискальныйНомер, "");
			ФискальнаяОперацияРеквизиты.АвтономныйРежимРаботыКассы 	= ?(ВыходныеПараметры[4].Свойство("АвтономныйРежимРаботы"), ВыходныеПараметры[4].АвтономныйРежимРаботы, Ложь);
			ФискальнаяОперацияРеквизиты.РегистрационныйНомерКассы 	= ?(ВыходныеПараметры[4].Свойство("РегистрационныйНомерККМ"), ВыходныеПараметры[4].РегистрационныйНомерККМ, "");
			ФискальнаяОперацияРеквизиты.ДатаВремяЧека				= ?(ВыходныеПараметры[4].Свойство("ДатаЧека"), ВыходныеПараметры[4].ДатаЧека, Дата("00010101")); 
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли; 
	КонецЕсли;
	// ОМГ
    ///////////////////////////////////////////////////////////
	
	ФискальнаяОперацияРеквизиты.ОбщаяСуммаЧека 	= Форма.СуммаДокумента;
	ФискальнаяОперацияРеквизиты.ДокументСсылка 	= Форма.ДокументСсылка;
	ФискальнаяОперацияРеквизиты.ТорговыйОбъект 	= Неопределено;
	ФискальнаяОперацияРеквизиты.Организация 	= Форма.Организация;
   
	ПодключаемоеОборудованиеБКВызовСервера.ЗаписатьФискальнуюОперацийРК(ФискальнаяОперацияРеквизиты);
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Результат",         Истина);
	РезультатВыполнения.Вставить("ОписаниеОшибки",    НСтр("ru = 'Ошибок нет.'"));
	РезультатВыполнения.Вставить("ВыходныеПараметры", ВыходныеПараметры);
	
	Форма.Закрыть(РезультатВыполнения);
	
КонецПроцедуры

// Описание: Открывает форму оплаты эквайринговым терминалом (если используется)
//
Процедура ОплатитьКартой(Форма, ОповещениеЗавершение) Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ТипТранзакции",               Форма.ПараметрыЭквайринговойОперации.ТипТранзакции);
	ПараметрыОткрытияФормы.Вставить("Сумма",                       Форма.ПараметрыЭквайринговойОперации.Сумма);
	ПараметрыОткрытияФормы.Вставить("ПределСуммы",                 Форма.ПараметрыЭквайринговойОперации.Сумма);
	ПараметрыОткрытияФормы.Вставить("УказатьДополнительныеДанные", Форма.ПараметрыЭквайринговойОперации.ТипТранзакции = "AuthorizeRefund");
	
	Если ТипЗнч(Форма.ДокументСсылка) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
		ПараметрыОткрытияФормы.Вставить("ЗапретРедактированияСуммы", Истина);
	КонецЕсли;
	
	ОткрытьФорму(
		"Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",
		ПараметрыОткрытияФормы,,,,,
		ОповещениеЗавершение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Описание: Записывает документ после оплаты по эквайрингу
//
Процедура ЗаписатьОбъектЭквайринговаяОперация(ВладелецФормы, ОповещениеЗавершение) Экспорт
	
	//в БК не используется
	ВыполнитьОбработкуОповещения(ОповещениеЗавершение, Истина);
		
КонецПроцедуры

// Проверяет соответствие ИИН / БИН требованиям.
//
// Параметры:
//  ИИН                - Строка - проверяемый Индивидуальный идентификационный номер (или БИН).
//  ТекстСообщения     - Строка - текст сообщения о найденных ошибках.
//
// Возвращаемое значение:
//  Булево - Истина, если соответствует.
//
Функция ИИНСоответствуетТребованиям(Знач ИИН, ТекстСообщения = "") Экспорт
	
	СоответствуетТребованиям = Истина;
	ТекстСообщения = "";
	
	ИНН      = СокрЛП(ИИН);
	ДлинаИНН = СтрДлина(ИИН);
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИНН) Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'БИН/ИИН должен состоять только из цифр.'");
	КонецЕсли;

	Если ДлинаИНН <> 12 Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
			+ НСтр("ru = 'БИН/ИИН должен состоять из 12 цифр.'");
	КонецЕсли;

	Если СоответствуетТребованиям Тогда
	// а12 = (а1*b1+а2*b2+а3*b3+а4*b4+а5*b5+а6*b6+а7*b7+а8*b8+а9*b9+a10*b10+a11*b11) mod 11
		
		ПодстрокаИН11 = Лев(ИНН,11);        // копируем первые 11 символов
		КонтрольноеЗначение = Прав(ИНН, 1); // контрольная сумма ИИН/БИН
		
		// Разряд ИИН: 1 2 3 4 5 6 7 8 9 10 11
		// Вес разряда: 1 2 3 4 5 6 7 8 9 10 11
		
		СуммаРазрядов = 1 * Сред(ИНН, 1, 1) + 2 * Сред(ИНН, 2, 1) +
		3 * Сред(ИНН, 3, 1) + 4 * Сред(ИНН, 4, 1) +
		5 * Сред(ИНН, 5, 1) + 6 * Сред(ИНН, 6, 1) +
		7 * Сред(ИНН, 7, 1) + 8 * Сред(ИНН, 8, 1) +
		9 * Сред(ИНН, 9, 1) + 10 * Сред(ИНН, 10, 1) + 11 * Сред(ИНН, 11, 1);
		ВычисленноеКонтрольноеЗначение = СуммаРазрядов - Цел(СуммаРазрядов / 11) * 11; // mod - остаток от деления Суммы разрядов на 11.
		
		Если ВычисленноеКонтрольноеЗначение = 10 Тогда
			
			// Разряд ИИН: 1 2 3 4 5 6 7 8 9 10 11 
			// Вес разряда: 3 4 5 6 7 8 9 10 11 1 2
			
			СуммаРазрядов = 3 * Сред(ИНН, 1, 1) + 4 * Сред(ИНН, 2, 1) +
			5 * Сред(ИНН, 3, 1) + 6 * Сред(ИНН, 4, 1) +
			7 * Сред(ИНН, 5, 1) + 8 * Сред(ИНН, 6, 1) +
			9 * Сред(ИНН, 7, 1) + 10 * Сред(ИНН, 8, 1) +
			11 * Сред(ИНН, 9, 1) + 1 * Сред(ИНН, 10, 1) + 2 * Сред(ИНН, 11, 1);
			ВычисленноеКонтрольноеЗначение = СуммаРазрядов - Цел(СуммаРазрядов / 11) * 11;   
			
		КонецЕсли;
		
		Если ВычисленноеКонтрольноеЗначение <> Число(КонтрольноеЗначение) Тогда
			
			СоответствуетТребованиям = Ложь;
			ТекстСообщения = НСтр("ru = 'Контрольное число БИН/ИИН не совпадает с рассчитанным.'");
			
		КонецЕсли;

	КонецЕсли;

	Возврат СоответствуетТребованиям;
	
КонецФункции
 // Открыть форму записи журнала фискальных операций.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма.
//  ДанныеЖурналаФискальныхОпераций - Структура со свойствами:
//   * ИдентификаторЗаписи - Строка - Идентификатор записи.
//   * ДокументОснование - ДокументСсылка - Ссылка на документ-основание.
//
Процедура ОткрытьЗаписьЖурналаФискальныхОпераций(Форма, ДанныеЖурналаФискальныхОпераций) Экспорт
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("ИдентификаторЗаписи", ДанныеЖурналаФискальныхОпераций.ИдентификаторЗаписи);
	ПараметрыЗаписи.Вставить("ДокументОснование",   ДанныеЖурналаФискальныхОпераций.ДокументОснование);
	
	ЗначениеКлюча = Новый Массив;
	ЗначениеКлюча.Добавить(ПараметрыЗаписи);
	
	КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.ФискальныеОперацииРК", ЗначениеКлюча);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	
	ОткрытьФорму("РегистрСведений.ФискальныеОперацииРК.Форма.ФормаЗаписи", ПараметрыФормы, Форма);
	
КонецПроцедуры
